 # üêº Pandas Hands-On Task Series

 ## Dataset Creation

In [1]:
import pandas as pd

In [2]:
data = {
    "emp_id": [101, 102, 103, 104, 105],
    "name": ["Asha", "Ravi", "Kiran", "Neha", "Arjun"],
    "department": ["IT", "HR", "IT", "Finance", "HR"],
    "salary": [60000, 45000, 70000, 50000, 48000],
    "experience": [3, 2, 5, 4, 1]
}

df = pd.DataFrame(data)
df

   emp_id   name department  salary  experience
0     101   Asha         IT   60000           3
1     102   Ravi         HR   45000           2
2     103  Kiran         IT   70000           5
3     104   Neha    Finance   50000           4
4     105  Arjun         HR   48000           1

### .loc vs .iloc

In [5]:
#Task 1.1
#Using .loc, select employees who belong to the IT department and display only name and salary.
df.loc[df["department"] == "IT", ["name", "salary"]]

    name  salary
0   Asha   60000
2  Kiran   70000

In [6]:
#Task 1.2
#Using .iloc, fetch the first 3 rows and first 2 columns.
df.iloc[:3, :2]

   emp_id   name
0     101   Asha
1     102   Ravi
2     103  Kiran

In [ ]:
#Task 1.3
#Explain why .iloc[0] works but .loc[0] may fail in some datasets.
#iloc--->‚ÄúGive me the first row, regardless of the index label.‚Äù
#loc--->‚ÄúGive me the row whose index label is exactly 0.‚Äù

##  Renaming Columns

In [7]:
#Task 2.1
#Rename:
#emp_id ‚Üí employee_id
#name ‚Üí employee_name
df1=df.rename(columns={"emp_id":"employee_id","name":"employee_name"})
df1

   employee_id employee_name department  salary  experience
0          101          Asha         IT   60000           3
1          102          Ravi         HR   45000           2
2          103         Kiran         IT   70000           5
3          104          Neha    Finance   50000           4
4          105         Arjun         HR   48000           1

In [8]:
#Task 2.2
#Convert all column names to uppercase
df1.columns=[i.upper() for i in df1.columns]
df1

   EMPLOYEE_ID EMPLOYEE_NAME DEPARTMENT  SALARY  EXPERIENCE
0          101          Asha         IT   60000           3
1          102          Ravi         HR   45000           2
2          103         Kiran         IT   70000           5
3          104          Neha    Finance   50000           4
4          105         Arjun         HR   48000           1

## Task 3.1

In [10]:
#Task 3.1
#Remove the column bonus.
#df.drop(columns=["bonus"], inplace=True)

In [13]:
#Task 3.2
#Delete employees whose experience is less than 2 years.
df = df.drop(df[df["experience"] < 2].index)
df

   emp_id   name department  salary  experience
0     101   Asha         IT   60000           3
1     102   Ravi         HR   45000           2
2     103  Kiran         IT   70000           5
3     104   Neha    Finance   50000           4

In [18]:
#Task 3.3
#Drop the row where employee_name == "Neha
df = df.drop(df[df["name"] == "Neha"].index)
df

   emp_id   name department  salary  experience
0     101   Asha         IT   60000           3
1     102   Ravi         HR   45000           2
2     103  Kiran         IT   70000           5

 ## Boolean Indexing

In [ ]:
#Task 4.1
#Filter employees who:
#work in HR
#AND salary > 46000

In [20]:
df[(df["salary"]> 46000) & (df["department"]=="IT")]

   emp_id   name department  salary  experience
0     101   Asha         IT   60000           3
2     103  Kiran         IT   70000           5

In [24]:
#Task 4.2
#Filter employees who:
#work in IT
#OR experience ‚â• 5
df[(df["experience"]) >= 5 | (df["department"]=="IT")]

   emp_id   name department  salary  experience
0     101   Asha         IT   60000           3
1     102   Ravi         HR   45000           2
2     103  Kiran         IT   70000           5

## AND, OR, NOT Conditions

In [26]:
#Task 5.1
#Select employees who are:
#NOT in HR department
df[~df["department"].isin(["department"])]

   emp_id   name department  salary  experience
0     101   Asha         IT   60000           3
1     102   Ravi         HR   45000           2
2     103  Kiran         IT   70000           5

In [27]:
#Task 5.2
#Select employees who:
#are NOT earning more than 60000
df[~df["salary"].isin([60000])]

   emp_id   name department  salary  experience
1     102   Ravi         HR   45000           2
2     103  Kiran         IT   70000           5

## isin() and not in

In [4]:
import pandas as pd

In [5]:
data = {
    "emp_id": [101, 102, 103, 104, 105],
    "name": ["Asha", "Ravi", "Kiran", "Neha", "Arjun"],
    "department": ["IT", "HR", "IT", "Finance", "HR"],
    "salary": [60000, 45000, 70000, 50000, 48000],
    "experience": [3, 2, 5, 4, 1]
}

df = pd.DataFrame(data)
df

   emp_id   name department  salary  experience
0     101   Asha         IT   60000           3
1     102   Ravi         HR   45000           2
2     103  Kiran         IT   70000           5
3     104   Neha    Finance   50000           4
4     105  Arjun         HR   48000           1

In [7]:
#### Task 6.1
#Select employees whose department is in:
#["IT", "Finance"]
df[df["department"].isin(["IT", "Finance"])]

   emp_id   name department  salary  experience
0     101   Asha         IT   60000           3
2     103  Kiran         IT   70000           5
3     104   Neha    Finance   50000           4

In [8]:
#Task 6.2
#Select employees whose names are NOT in:
#["Asha", "Arjun"]

df[~df["name"].isin(["Asha", "Arjun"])]

   emp_id   name department  salary  experience
1     102   Ravi         HR   45000           2
2     103  Kiran         IT   70000           5
3     104   Neha    Finance   50000           4

## tolist() and to_numpy()

In [9]:
#Task 7.1
#Convert the salary column into a Python list.
salary_list = df["salary"].tolist()
salary_list

[60000, 45000, 70000, 50000, 48000]

In [11]:
#Task 7.2
#Convert the entire DataFrame into a NumPy array.
array_data = df.to_numpy()
array_data

array([[101, 'Asha', 'IT', 60000, 3],
       [102, 'Ravi', 'HR', 45000, 2],
       [103, 'Kiran', 'IT', 70000, 5],
       [104, 'Neha', 'Finance', 50000, 4],
       [105, 'Arjun', 'HR', 48000, 1]], dtype=object)

##  set_index, reset_index, sort_index

In [13]:
#Task 8.1
#Set employee_id as the index.
df = df.set_index("emp_id")
df

         name department  salary  experience
emp_id
101      Asha         IT   60000           3
102      Ravi         HR   45000           2
103     Kiran         IT   70000           5
104      Neha    Finance   50000           4
105     Arjun         HR   48000           1

In [14]:
#Task 8.2
#Sort the DataFrame based on the index.
df = df.sort_index()
df

         name department  salary  experience
emp_id
101      Asha         IT   60000           3
102      Ravi         HR   45000           2
103     Kiran         IT   70000           5
104      Neha    Finance   50000           4
105     Arjun         HR   48000           1

In [15]:
#Task 8.3
#Reset the index back to default and drop the old index.
df = df.reset_index(drop=True)
df

    name department  salary  experience
0   Asha         IT   60000           3
1   Ravi         HR   45000           2
2  Kiran         IT   70000           5
3   Neha    Finance   50000           4
4  Arjun         HR   48000           1

##  astype()

In [16]:
#Task 9.1
#Convert:
#salary ‚Üí float
#experience ‚Üí string
df["salary"] = df["salary"].astype(float)
df["experience"] = df["experience"].astype(str)
df.dtypes

name           object
department     object
salary        float64
experience     object
dtype: object

In [17]:
#Task 9.2
#Explain why incorrect astype() usage can break ML pipelines.
#df["experience"] = df["experience"].astype(str)

## sort_values()

In [18]:
#Task 10.1
#Sort employees by:
#salary (descending)
df = df.sort_values(by="salary", ascending=False)
df

    name department   salary experience
2  Kiran         IT  70000.0          5
0   Asha         IT  60000.0          3
3   Neha    Finance  50000.0          4
4  Arjun         HR  48000.0          1
1   Ravi         HR  45000.0          2

In [19]:
#Task 10.2
#Sort employees by:
#department (ascending)
#salary (descending)
df = df.sort_values(
    by=["department", "salary"],
    ascending=[True, False]
)

df

    name department   salary experience
3   Neha    Finance  50000.0          4
4  Arjun         HR  48000.0          1
1   Ravi         HR  45000.0          2
2  Kiran         IT  70000.0          5
0   Asha         IT  60000.0          3

##  drop()

In [20]:
#Task 11.1
#Drop the column experience.
df = df.drop(columns=["experience"])
df

    name department   salary
3   Neha    Finance  50000.0
4  Arjun         HR  48000.0
1   Ravi         HR  45000.0
2  Kiran         IT  70000.0
0   Asha         IT  60000.0

In [21]:
#Task 11.2
#Drop rows where salary < 50000 using index-based logic.
low_salary_index = df[df["salary"] < 50000].index
df = df.drop(index=low_salary_index)
df

    name department   salary
3   Neha    Finance  50000.0
2  Kiran         IT  70000.0
0   Asha         IT  60000.0